# St7GetSolverDefaultsLogical

Returns the state assigned for a set of Boolean parameters for the analysis.

long St7GetSolverDefaultsLogical(long uID, long Parameter, bool* Value)

Input Parameters

uID

Strand7 model file ID.

Parameter

Solver logical parameter; see Logical Parameters.

Output Parameters

Value

Either True or False.